// useEffect — це хук у React,
// який виконує код після рендеру
// компонента.

// -------------------------------------
// Простішими словами

// useEffect — це спосіб сказати React:
// “зроби щось після того, як компонент
// відобразився”
// -------------------------------------
// Найпростіший приклад

import { useEffect } from "react";

function App() {
  useEffect(() => {
    console.log("Компонент відрендерився");
  });

  return <h1>Hello</h1>;
}

// Код виконається після кожного рендеру
// ----------------------------------
// Важливий момент — залежності

useEffect(() => {
  console.log("Один раз");
}, []);

// Порожній масив = виконається
// тільки один раз

useEffect(() => {
  console.log("count змінився");
}, [count]);

// Виконується тільки коли змінюється count
// ----------------------------------
// Підсумок:

// Props — дані, які приходять
// у компонент.
// State — дані, які живуть
// всередині компонента.
// -------------------------------------

// Пиши в коментарях, що хочеш побачити
// в наступному відео.
