// useState — це хук у React,
// який дозволяє компоненту
// зберігати дані.

// -------------------------------------
// Простішими словами:
// useState — це спосіб зберегти
// значення всередині компонента.

// -------------------------------------
// Приклад:

import { useState } from "react";

function Counter() {
  const [count, setCount] = useState(0); //0 — це початкове значення.
  // count — це поточне значення.
  //setCount — це функція, яка його змінює
  return <button onClick={() => setCount(count + 1)}>{count}</button>;
  //Ми змінюємо стан і React автоматично оновлює інтерфейс.
}
// ----------------------------------
// Чому без useState не працює:

let count = 0;
// Звичайна змінна не викликає перерендер.
// React просто не знає, що щось змінилося.

// ----------------------------------
// Підсумок:

// useState = зберегти значення + змусити
// React оновити інтерфейс
// -------------------------------------
// Хочеш окреме відео про компоненти
// або state? Пиши в коментарях.
