// Hooks — це спеціальні функції в React,
// які дозволяють використовувати можливості
// React у функціональних компонентах.

// -------------------------------------
// Простішими словами:

// Хуки дозволяють компонентам:

//  зберігати стан
//  працювати з ефектами
//  використовувати логіку React
// -------------------------------------
// Приклад useState:

import { useState } from "react";

function Counter() {
  const [count, setCount] = useState(0);

  return <button onClick={() => setCount(count + 1)}>{count}</button>;
}

// useState дозволяє зберігати дані
// у компоненті.
// ----------------------------------
// Приклад 2 useEffect:

// useEffect(() => {
//   console.log("Component mounted");
// }, []);

// useEffect виконує код після
// рендеру компонента.

// ----------------------------------
// Найпопулярніші Хуки:

// У React найчастіше використовують:
//  useState — стан
//  useEffect — ефекти
//  useContext — доступ до даних
//  useRef — робота з DOM
// -------------------------------------
// Підсумок:

// Хуки дозволяють додавати логіку
// React у функціональні компоненти.
// -------------------------------------
// Пиши в коментарях, що хочеш побачити
// в наступному відео.
