// Props(properties) — це спосіб
// передавати дані між
// компонентами в React.

// -------------------------------------
// Простішими словами:

// Props — це параметри,
// які компонент отримує
// від батьківського компонента.
// -------------------------------------
// Приклад компонент без props:

function Greeting() {
  return <h1>Hello!</h1>;
}

// Цей компонент завжди показує
// один і той самий текст.
// ----------------------------------
// Приклад 2 компонент з props:

function Greeting(props) {
  return <h1>Hello, {props.name}</h1>;
}

// Тепер компонент показує різні
// значення, бо отримує дані
// через props.

{
  /* <Greeting name="Anna" />
    <Greeting name="Oleg" /> */
}
// ----------------------------------
// Важлива особливість:

// Props — тільки для читання.
// Компонент не може їх змінювати.
// -------------------------------------
// Підсумок:

Props передають дані вниз по дереву компонентів.
// -------------------------------------
// Пиши в коментарях, що хочеш побачити
// в наступному відео.
