// JSX — це синтаксис,
// який дозволяє писати HTML
// прямо всередині JavaScript у React.

// -------------------------------------
// Простішими словами:

// JSX — це спосіб описати
// інтерфейс у React.
// -------------------------------------
// Приклад JSX:

const element = <h1>Hello React</h1>;
// Це виглядає як HTML, але насправді
// це JavaScript.
// ----------------------------------
// Що відбувається насправді:

// JSX перетворюється на звичайний JavaScript.
// const element = <h1>Hello</h1>;
// перетворюється на:
React.createElement("h1", null, "Hello");

// ----------------------------------
// Приклад у компоненті:

function App() {
  return (
    <div>
      <h1>Hello</h1>
      <p>My first React app</p>
    </div>
  );
}

// JSX дозволяє описувати інтерфейс
// дуже зрозуміло.

// -------------------------------------
// Підсумок:

// JSX — це просто зручний спосіб писати
// React-інтерфейс.
// -------------------------------------

// Пиши в коментарях, що хочеш побачити
// в наступному відео.
