// Бо це помилка в JavaScript, яка існує з
// самого початку мови.

// І її не виправили, бо це зламало
// б мільйони сайтів.
// -------------------------------------
// Пояснення простими словами

// У перших версіях JavaScript значення типів
// зберігались як бінарні мітки.

// null отримав мітку 0
// обʼєкти теж мали мітку 0

// Тому typeof не зміг відрізнити
// null від обʼєкта.

//  -------------------------------------
// Приклад

typeof null; // "object"
// Але логічно null — це просто нічого.

// -------------------------------------
// Важливе уточнення

null instanceof Object; // false

// Тобто null НЕ є обʼєктом.
// typeof тут просто помиляється.
// -------------------------------------
// Підсумок:

// typeof null === "object"
// це історичний баг JavaScript.
// -------------------------------------

// Пиши в коментарях, що хочеш побачити
// в наступному відео.
