// Обʼєктно - орієнтоване програмування(ООП) —
// це підхід,де програма складається
// з обʼєктів з даними та діями.
// -------------------------------------
// Приклад:
const user = {
  name: "Anastasiia",
  age: 18,
  sayHi() {
    console.log("Привіт!");
  },
};
// name і age — дані
// sayHi — поведінка (метод)
//  -------------------------------------
// Основні принципи ООП

// 1.Інкапсуляція
// — обʼєкт зберігає все всередині себе

// 2.Наслідування
// — один обʼєкт може переймати властивості
// іншого.

// 3️. Поліморфізм
// — одна дія, але різна поведінка

// 4️. Абстракція
// — ми працюємо з важливим,
// а не з деталями
// -------------------------------------
// Де використовують ООП?

// у JavaScript (класи, обʼєкти)
// у React (компоненти як обʼєкти)
// у великих проєктах

// -------------------------------------
// Підсумок:

// ООП — це спосіб думати обʼєктами,
// а не рядками коду.
// -------------------------------------

// Пиши в коментарях, що хочеш побачити
// в наступному відео.
