// React — це JavaScript - бібліотека для
// створення інтерфейсів користувача.

// -------------------------------------
// Він допомагає створювати вебсторінки
// з маленьких частин — компонентів.

function Button() {
  return <button>Click me</button>;
}

// Це компонент, шматочок інтерфейсу.

// Кожна кнопка, форма або картка,
// це окремий компонент.
// -------------------------------------
// Головна ідея React

// Коли дані змінюються,
// React автоматично оновлює інтерфейс.

// Тобто тобі не потрібно вручну
// змінювати HTML.
// -------------------------------------

// ----------------------------------
// Підсумок:

// -------------------------------------
// Хочеш окреме відео про компоненти
// або state? Пиши в коментарях.
