// У React майже все компонент.
// Але що це означає ?

// -------------------------------------
// Компонент у React — це шматочок
// інтерфейсу з власною логікою,
// це функція, яка повертає HTML.
// ------------------------------
// Приклад:

// -------------------------------------
// Найпростіший компонент:
function Title() {
  return <h1>Hello React</h1>;
}

// Цей компонент відповідає тільки за
// заголовок.
// -------------------------------------
// Кнопка як компонент:
function Button() {
  return <button>Click me</button>;
}
// Кнопка — це окремий компонент, який можна
// використовувати багато разів.
// ----------------------------------
// Сторінка з компонентів:

function App() {
  return (
    <div>
      <Title />
      <Button />
      <Button />
    </div>
  );
}
// Вся сторінка збирається з маленьких частин.
// ----------------------------------
// Компонент з логікою:

function Counter() {
  const [count, setCount] = React.useState(0);

  return <button onClick={() => setCount(count + 1)}>{count}</button>;
}

// Компонент може зберігати стан і реагувати на
// дії користувача.
// ----------------------------------
// Підсумок:

// Компонент у React — це шматочок
// інтерфейсу з власною логікою,
// це функція, яка повертає HTML.
// -------------------------------------
// Хочеш окреме відео про компоненти
// або state? Пиши в коментарях.
