// У JavaScript примітиви тимчасово
// перетворюються в обʼєкти.

// Саме тому це майже обʼєкти,
// а не завжди.
// -------------------------------------
// Приклад:

"hello".toUpperCase();

// На цей момент JavaScript обгортає рядок
// у спеціальний обʼєкт String.

// Потім викликає метод і одразу прибирає
// обгортку.
//  -------------------------------------

// Так працює з рядками, числами і
// булевими значеннями.

(42).toFixed(1);
true.toString();
// -------------------------------------
// Важливе уточнення

// А от null і undefined це особливі типи.
// Вони не обгортаються в обєкт.
// У них немає методів.
// -------------------------------------
// Підсумок:

// Примітиви: string, number, boolean.
// Вони не обʼєкти, але поводяться як
// обʼєкти.
// Бо JS тимчасово їх обгортає.

// Це зроблено для зручності,
// щоб ми могли писати простий і
// читабельний код.
// -------------------------------------

// Пиши в коментарях, що хочеш побачити
// в наступному відео.
