// Обʼєкт у JavaScript — це значення,
// яке може мати властивості та методи.
// -------------------------------------
function sayHi() {}

// Функція виглядає як інструкція,
// але з нею можна робити те саме,
// що й з обʼєктом.
// -------------------------------------
// У функції є властивості
sayHi.name; // "sayHi"
sayHi.length; // кількість параметрів

// Це вже ознака обʼєкта.
// -------------------------------------
// У функції є методи

sayHi.call(null);
sayHi.apply(null);
sayHi.bind(null);

// Звичайні методи, як у будь-якого
// обʼєкта.
// -------------------------------------
// Але чому тоді це функція?

// Бо в неї є особлива здатність
// її можна викликати.
sayHi();
// -------------------------------------
// Підсумок:
// Функція — це обʼєкт, який можна викликати.
// Саме це відрізняє її від звичайного обʼєкта.
// -------------------------------------
// Пиши в коментарях, що хочеш побачити
// в наступному відео.
