// Прототипи в JavaScript — це спосіб
// ділитися методами між обʼєктами.

// Якщо в обʼєкті немає потрібного методу,
// JavaScript шукає його в прототипі.
// -------------------------------------
// Приклад:
const user = {
  name: "Anastasiia",
};

user.toString();
// name і age — дані
// sayHi — поведінка (метод)
//  -------------------------------------
// Основні принципи ООП

// 1.Інкапсуляція
// — обʼєкт зберігає все всередині себе

// 2.Наслідування
// — один обʼєкт може переймати властивості
// іншого.

// 3️. Поліморфізм
// — одна дія, але різна поведінка

// 4️. Абстракція
// — ми працюємо з важливим,
// а не з деталями
// -------------------------------------
// Де використовують ООП?

// у JavaScript (класи, обʼєкти)
// у React (компоненти як обʼєкти)
// у великих проєктах

// -------------------------------------
// Підсумок:

// ООП — це спосіб думати обʼєктами,
// а не рядками коду.
// -------------------------------------

// Пиши в коментарях, що хочеш побачити
// в наступному відео.
