// Інкапсуляція — це коли ми ховаємо
// внутрішню логіку обʼєкта
// і дозволяємо працювати з ним лише
// через методи
// -------------------------------------
// Приклад
class User {
  #password = "1234";

  checkPassword(pass) {
    return pass === this.#password;
  }
}

// Ми не можемо напряму змінити пароль
// лише через метод
// -------------------------------------
// Наслідування — це коли один клас
// отримує властивості та методи іншого.

// Як дитина успадковує риси батьків.
// -------------------------------------
// Приклад:
class Animal {
  eat() {
    console.log("Eating");
  }
}

class Dog extends Animal {
  bark() {
    console.log("Woof");
  }
}

// Animal — це базовий клас.
// extends означає: Dog отримує все,
// що є в Animal та ми додали новий
// метод bark();
// ----------------------------------
// Підсумок:

// Інкапсуляція захищає внутрішній
// стан обʼєкта.
// Наслідування дозволяє повторно
// використовувати код.
// -------------------------------------

// Пиши в коментарях, що хочеш побачити
// в наступному відео.
