// ООП — це коли ми пишемо код,
// думаючи як про реальні об'єкти
// з життя.

// Обєкт = річ + що вона вміє робити

// Наприклад:

// Користувач
// має: імя, email
// вміє: логінитись, виходити
// -------------------------------------
// Об'єкт

// Об'єкт — це просто коробка з даними
// і функціями.

const user = {
  name: "Anastasiia",
  age: 18,
  sayHi() {
    console.log("Привіт!");
  },
};

// Запам'ятай:
// об'єкт = властивості + методи
//  -------------------------------------
// Клас — це інструкція, за якою ми
// створюємо об'єкти.

// Клас — це рецепт
// Об'єкт — це торт

class User {
  constructor(name, age) {
    this.name = name;
    this.age = age;
  }

  sayHi() {
    console.log("Привіт!");
  }
}

const user1 = new User("Anastasiia", 18);
const user2 = new User("Anna", 20);

// -------------------------------------
// Інкапсуляція

// Це означає:
// сховати те, що не потрібно бачити ззовні

class BankAccount {
  #balance = 0; // ніхто не може змінити
  напряму;

  addMoney(amount) {
    this.#balance += amount;
  }

  getBalance() {
    return this.#balance;
  }
}

// Ти не можеш зробити account.balance = 100000
// Але можеш через метод — і це безпечніше

// -------------------------------------
// Наслідування

// Коли один об'єкт успадковує
// властивості іншого.

class User {
  login() {
    console.log("User logged in");
  }
}

class Admin extends User {
  deleteUser() {
    console.log("User deleted");
  }
}

// Admin — це User, але з додатковими
// можливостями

// -------------------------------------
// Поліморфізм

// Одна і та сама команда —
// різна поведінка

class Animal {
  speak() {
    console.log("Sound");
  }
}

class Cat extends Animal {
  speak() {
    console.log("Meow");
  }
}

class Dog extends Animal {
  speak() {
    console.log("Woof");
  }
}

// speak() — одна назва,
// різний результат.
// -------------------------------------
// Коротко:
// Об'єкт — річ з даними і діями
// Клас — шаблон для об'єктів
// Інкапсуляція — ховаємо зайве
// Наслідування — один клас від іншого
// Поліморфізм — одна дія, різний результат

// -------------------------------------
// Пиши в коментарях, що хочеш побачити
// в наступному відео.
