// У JavaScript обʼєкти порівнюються
// НЕ за значенням.
// -------------------------------------
// Просте пояснення

// Кожен обʼєкт — це окреме місце в памʼяті.
// Навіть якщо вони виглядають однаково
// це два різні обʼєкти.
// -------------------------------------
// Приклад
const a = {};
const b = {};

a === b; // false
// Бо a і b вказують на різні
// обʼєкти в памʼяті.
// -------------------------------------
// А тепер важливий момент

// const a = {};
// const b = a;

a === b; // true

// Тут обидві змінні вказують на ОДИН
// і той самий обʼєкт.
// -------------------------------------
// Підсумок:

// Обʼєкти порівнюються за посиланням,
// а не за значенням.
// Тому {} === {} завжди false.

// Те саме стосується масивів і функцій.
// [] === [] // false
// -------------------------------------
// Пиши в коментарях, що хочеш побачити
// в наступному відео.
