// 'use strict' — це суровий режим
// JavaScript, який змушує код працювати
// більш безпечно тапередбачувано.

// Він допомагає ловити помилки,
// які в звичайному режимі JavaScript
// просто ігнорує

// -------------------------------------
// Приклад 1: змінна без оголошення
// Неправильно
"use strict";
age = 18;

// -------------------------------------
Object.values();
// Повертає всі значення обʼєкта
// у вигляді масиву.

// Навіщо:
// Коли важливі не ключі, а самі дані.

Object.values(user);
// ["Anna", 18]

// Зручно, наприклад, для фільтрації
// або перевірок.

// -------------------------------------
Object.entries();
// Перетворює обʼєкт
// у масив пар[ключ, значення].

// Навіщо:
// Ідеально для циклів і map, filter.

Object.entries(user);
// [["name", "Anna"], ["age", 18]]
// -------------------------------------
Object.assign();
// Копіює або обʼєднує обʼєкти.

const a = { x: 1 };
const b = { y: 2 };

Object.assign(a, b);
// { x: 1, y: 2 }
// -------------------------------------
// Пиши в коментарях, що хочеш побачити
// в наступному відео.
